[Survived] BooleanLiteral
React/clean-project-ts-husky-linter-prettier/src/index.ts:1:12
-const bb = true;
+const bb = false;
 
 const oi = (aa) => {

[Killed] BlockStatement
React/clean-project-ts-husky-linter-prettier/src/index.ts:3:20
 const bb = true;
 
-const oi = (aa) => {
-  if (aa || bb) {
-    console.log('oi');
-    return 1;
-  }
-  return 2;
-};
+const oi = (aa) => {};
 
 export default oi;
killedBy: Test test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
React/clean-project-ts-husky-linter-prettier/src/index.ts:4:17
 const bb = true;
 
 const oi = (aa) => {
-  if (aa || bb) {
-    console.log('oi');
-    return 1;
-  }
+  if (aa || bb) {}
   return 2;
 };
killedBy: Test test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
React/clean-project-ts-husky-linter-prettier/src/index.ts:4:7
 const bb = true;
 
 const oi = (aa) => {
-  if (aa || bb) {
+  if (false) {
     console.log('oi');
     return 1;
killedBy: Test test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2
